<?xml version="1.0" ?>
<net batch="1" name="model-out" version="3">
	<layers>
		<layer id="0" name="img_placeholder" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="9,9" output="32" pads_begin="4,4" pads_end="4,4" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="31104"/>
			</blobs>
		</layer>
		<layer id="2" name="moments/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="199,253" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="sub/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="sub/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="199"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="sub/add_/Broadcast/1124" precision="FP32" type="Tile">
			<data axis="3" tiles="253"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="sub/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="moments/SquaredDifference/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="moments/SquaredDifference/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="199"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="moments/SquaredDifference/add_/Broadcast/1116" precision="FP32" type="Tile">
			<data axis="3" tiles="253"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="moments/SquaredDifference/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="moments/SquaredDifference/squared_" precision="FP32" type="Power">
			<data power="2" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="moments/variance" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="199,253" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="add" precision="FP32" type="Power">
			<data power="1" scale="1" shift="0.0010000000474974513"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Rsqrt" precision="FP32" type="Power">
			<data power="-0.5" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="mul/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="199"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="mul/Broadcast/1248" precision="FP32" type="Tile">
			<data axis="3" tiles="253"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="mul" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="mul_1/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</output>
			<blobs>
				<weights offset="31104" size="128"/>
				<biases offset="31232" size="128"/>
			</blobs>
		</layer>
		<layer id="19" name="Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv2D_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>199</dim>
					<dim>253</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</output>
			<blobs>
				<weights offset="31360" size="73728"/>
			</blobs>
		</layer>
		<layer id="21" name="moments_1/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="100,127" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="sub_1/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="sub_1/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="100"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="sub_1/add_/Broadcast/1236" precision="FP32" type="Tile">
			<data axis="3" tiles="127"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="sub_1/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="moments_1/SquaredDifference/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="moments_1/SquaredDifference/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="100"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="moments_1/SquaredDifference/add_/Broadcast/1076" precision="FP32" type="Tile">
			<data axis="3" tiles="127"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="moments_1/SquaredDifference/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="moments_1/SquaredDifference/squared_" precision="FP32" type="Power">
			<data power="2" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="moments_1/variance" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="100,127" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="add_2" precision="FP32" type="Power">
			<data power="1" scale="1" shift="0.0010000000474974513"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Rsqrt_1" precision="FP32" type="Power">
			<data power="-0.5" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="mul_2/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="100"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="mul_2/Broadcast/1216" precision="FP32" type="Tile">
			<data axis="3" tiles="127"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="mul_2" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="mul_3/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</output>
			<blobs>
				<weights offset="105088" size="256"/>
				<biases offset="105344" size="256"/>
			</blobs>
		</layer>
		<layer id="38" name="Relu_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv2D_2" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="0,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>127</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="105600" size="294912"/>
			</blobs>
		</layer>
		<layer id="40" name="moments_2/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="50,64" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="sub_2/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="sub_2/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="sub_2/add_/Broadcast/1200" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="sub_2/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="moments_2/SquaredDifference/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="moments_2/SquaredDifference/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="moments_2/SquaredDifference/add_/Broadcast/1232" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="moments_2/SquaredDifference/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="moments_2/SquaredDifference/squared_" precision="FP32" type="Power">
			<data power="2" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="moments_2/variance" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="50,64" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="add_4" precision="FP32" type="Power">
			<data power="1" scale="1" shift="0.0010000000474974513"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Rsqrt_2" precision="FP32" type="Power">
			<data power="-0.5" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="mul_4/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="mul_4/Broadcast/1192" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="mul_4" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="mul_5/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="400512" size="512"/>
				<biases offset="401024" size="512"/>
			</blobs>
		</layer>
		<layer id="57" name="Relu_2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv2D_3" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="401536" size="589824"/>
			</blobs>
		</layer>
		<layer id="59" name="moments_3/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="50,64" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="sub_3/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="sub_3/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="sub_3/add_/Broadcast/1128" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="sub_3/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="moments_3/SquaredDifference/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="moments_3/SquaredDifference/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="moments_3/SquaredDifference/add_/Broadcast/1096" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="moments_3/SquaredDifference/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="moments_3/SquaredDifference/squared_" precision="FP32" type="Power">
			<data power="2" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="moments_3/variance" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="50,64" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="add_6" precision="FP32" type="Power">
			<data power="1" scale="1" shift="0.0010000000474974513"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Rsqrt_3" precision="FP32" type="Power">
			<data power="-0.5" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="mul_6/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="mul_6/Broadcast/1184" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="mul_6" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="mul_7/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="991360" size="512"/>
				<biases offset="991872" size="512"/>
			</blobs>
		</layer>
		<layer id="76" name="Relu_3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv2D_4" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="992384" size="589824"/>
			</blobs>
		</layer>
		<layer id="78" name="moments_4/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="50,64" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="sub_4/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="sub_4/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="sub_4/add_/Broadcast/1256" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="sub_4/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="moments_4/SquaredDifference/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="moments_4/SquaredDifference/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="moments_4/SquaredDifference/add_/Broadcast/1172" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="moments_4/SquaredDifference/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="moments_4/SquaredDifference/squared_" precision="FP32" type="Power">
			<data power="2" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="moments_4/variance" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="50,64" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="add_8" precision="FP32" type="Power">
			<data power="1" scale="1" shift="0.0010000000474974513"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Rsqrt_4" precision="FP32" type="Power">
			<data power="-0.5" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="mul_8/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="mul_8/Broadcast/1132" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="mul_8" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="mul_9/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1582208" size="512"/>
				<biases offset="1582720" size="512"/>
			</blobs>
		</layer>
		<layer id="95" name="add_10" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv2D_5" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1583232" size="589824"/>
			</blobs>
		</layer>
		<layer id="97" name="moments_5/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="50,64" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="sub_5/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="sub_5/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="sub_5/add_/Broadcast/1244" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="sub_5/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="moments_5/SquaredDifference/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="moments_5/SquaredDifference/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="moments_5/SquaredDifference/add_/Broadcast/1212" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="moments_5/SquaredDifference/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="moments_5/SquaredDifference/squared_" precision="FP32" type="Power">
			<data power="2" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="moments_5/variance" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="50,64" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="add_11" precision="FP32" type="Power">
			<data power="1" scale="1" shift="0.0010000000474974513"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Rsqrt_5" precision="FP32" type="Power">
			<data power="-0.5" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="mul_10/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="mul_10/Broadcast/1188" precision="FP32" type="Tile">
			<data axis="3" tiles="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="mul_10" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="mul_11/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2173056" size="512"/>
				<biases offset="2173568" size="512"/>
			</blobs>
		</layer>
		<layer id="114" name="Relu_4" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv2D_6" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2174080" size="589824"/>
			</blobs>
		</layer>
		<layer id="116" name="moments_6/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="50,64" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="sub_6/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="sub_6/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="2" tiles="50"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
